zaoshuizaoxing/JD6628-Eight_Port/Drivers/PY32F031_HAL_Driver/Src/py32f031_hal_comp.c
  if(status == HAL_OK)
  {
    /* Set the lock bit corresponding to selected comparator */
    __HAL_COMP_LOCK(hcomp);
  }

  return status;
}


/**
  * @brief  Return the output level (high or low) of the selected comparator.
  *         The output level depends on the selected polarity.
  *         If the polarity is not inverted:
  *           - Comparator output is low when the input plus is at a lower
  *             voltage than the input minus
  *           - Comparator output is high when the input plus is at a higher
  *             voltage than the input minus
  *         If the polarity is inverted:
  *           - Comparator output is high when the input plus is at a lower
  *             voltage than the input minus
  *           - Comparator output is low when the input plus is at a higher
  *             voltage than the input minus
  * @param  hcomp  COMP handle
  * @retval Returns the selected comparator output level:
  *         @arg COMP_OUTPUT_LEVEL_LOW
  *         @arg COMP_OUTPUT_LEVEL_HIGH
  *
  */
uint32_t HAL_COMP_GetOutputLevel(COMP_HandleTypeDef *hcomp)
{
  /* Check the parameter */
  assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

  return (uint32_t)(READ_BIT(hcomp->Instance->CSR, COMP_CSR_COMP_OUT)
                    >> COMP_OUTPUT_LEVEL_BITOFFSET_POS);
}

/**
  * @brief  Comparator trigger callback.
  * @param  hcomp  COMP handle
  * @retval None
  */
__weak void HAL_COMP_TriggerCallback(COMP_HandleTypeDef *hcomp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hcomp);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_COMP_TriggerCallback should be implemented in the user file
   */
}


/**
  * @}
  */

/** @defgroup COMP_Exported_Functions_Group4 Peripheral State functions
  *  @brief   Peripheral State functions.
  *
@verbatim
 ===============================================================================
                      ##### Peripheral State functions #####
 ===============================================================================
    [..]
    This subsection permit to get in run-time the status of the peripheral.

@endverbatim
  * @{
  */

/**
  * @brief  Return the COMP handle state.
  * @param  hcomp  COMP handle
  * @retval HAL state
  */
HAL_COMP_StateTypeDef HAL_COMP_GetState(COMP_HandleTypeDef *hcomp)
{
  /* Check the COMP handle allocation */
  if(hcomp == NULL)
  {
    return HAL_COMP_STATE_RESET;
  }

  /* Check the parameter */
  assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

  /* Return HAL COMP handle state */
  return hcomp->State;
}

/**
  * @brief  Return the COMP error code.
  * @param hcomp COMP handle
  * @retval COMP error code
  */
uint32_t HAL_COMP_GetError(COMP_HandleTypeDef *hcomp)
{
  /* Check the parameters */
  assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

  return hcomp->ErrorCode;
}

/**
  * @}
  */


/* Private functions ---------------------------------------------------------*/

/** @addtogroup COMP_Private_Functions
  * @{
  */


/**
  * @brief  Check if need to configure the Vrefcmp
  * @param  hcomp  COMP handle
  * @retval 0 or 1
  */
static uint32_t COMP_VrefcmpCheck(COMP_HandleTypeDef *hcomp)
{ 
  return (((hcomp->Instance == COMP1) && (hcomp->Init.InputMinus == COMP_INPUT_MINUS_IO6)) 
    || ((hcomp->Instance == COMP2) && (hcomp->Init.InputMinus == COMP_INPUT_MINUS_IO4)));
}

/**
  * @brief  Configure the Vrefint or Vrefbuf or Vrefcmp 
  * @param  hcomp  COMP handle
  * @retval None
  */
static HAL_StatusTypeDef COMP_VrefConfig(COMP_HandleTypeDef *hcomp)
{ 
  HAL_StatusTypeDef status = HAL_OK;
  if(COMP_VrefcmpCheck(hcomp))
  {
    /* Voltage divider */  
    FlagStatus adcclkchanged = RESET;
      
    FlagStatus comp1clkchanged = RESET;
    
    if(hcomp->Instance == COMP2)   
    {
      if (__HAL_RCC_COMP1_IS_CLK_DISABLED() != 0U)
      {
        __HAL_RCC_COMP1_CLK_ENABLE();
        comp1clkchanged = SET;
      }
    }
         
    if(hcomp->Init.VrefSrc == COMP_VREFCMP_SOURCE_VCC)
    {
      SET_BIT(COMP1->CSR,COMP_CSR_VCSEL);
    }
    else
    {
      if (__HAL_RCC_ADC_IS_CLK_DISABLED() != 0U)
      {
        __HAL_RCC_ADC_CLK_ENABLE();
        adcclkchanged = SET;
      }
      
      MODIFY_REG(ADC1->CR, ADC_CR_VREFBUF_EN | ADC_CR_VREFBUF_SEL, (hcomp->Init.VrefSrc));
      /* Restore clock configuration if changed */
      if (adcclkchanged == SET)
      {
        __HAL_RCC_ADC_CLK_DISABLE();
      }
      
      CLEAR_BIT(COMP1->CSR,COMP_CSR_VCSEL);   
    }   

    MODIFY_REG(COMP1->CSR, COMP_CSR_VCDIV | COMP_CSR_VCDIV_EN, hcomp->Init.VrefDiv);    
    
    if(hcomp->Instance == COMP2)
    {      
      /* Restore clock configuration if changed */
      if (comp1clkchanged == SET)
      {
        __HAL_RCC_COMP1_CLK_DISABLE();
      }
    } 
  }
  else
  {
  }
  
  return status;
}  

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */



#endif /* HAL_COMP_MODULE_ENABLED */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
